DataProcessors/MRS_МассоваяСинхронизацияМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<DataProcessor>
		<Properties>
			<Name>MRS_МассоваяСинхронизацияМеню</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/MRS_СтатусыСинхронизацииМеню.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>MRS_СтатусыСинхронизацииМеню</Name>
			<Comment>Регистр для отслеживания статусов синхронизации позиций меню с Simphony</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Текущий статус синхронизации</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.MRS_СтатусыСинхронизации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбновления</Name>
					<Comment>Дата и время последнего обновления статуса</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Comment>Текст ошибки при синхронизации</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDЗапроса</Name>
					<Comment>X-Request-Id из заголовков запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>IDКорреляции</Name>
					<Comment>X-Correlation-Id из заголовков запроса</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПозицияМеню</Name>
					<Comment>Ссылка на позицию меню</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.MRS_Меню</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/MRS_СтатусыСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>MRS_СтатусыСинхронизации</Name>
			<Comment>Статусы синхронизации позиций меню с Simphony</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
					<Comment>Позиция создана в 1С, но еще не синхронизирована</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
					<Comment>Запрос на синхронизацию отправлен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синхронизировано</Name>
					<Comment>Успешно синхронизировано с Simphony</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
					<Comment>Ошибка при синхронизации</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/MRS_МассоваяСинхронизацияМеню/Ext/ObjectModule.bsl
// Обработка MRS_МассоваяСинхронизацияМеню
// Назначение: Массовая синхронизация позиций меню с Simphony REST API
// Сценарии: синхронизация выбранных, несинхронизированных, по владельцу

#Область ПрограммныйИнтерфейс

// Синхронизирует выбранные позиции меню с Simphony
//
// Параметры:
//   МассивСсылок - Массив из СправочникСсылка.MRS_Меню - массив ссылок на позиции меню для синхронизации
//   ИспользоватьПакетныйЗапрос - Булево - использовать пакетный запрос POST /menu-items (по умолчанию Истина)
//
// Возвращаемое значение:
//   Структура - результат синхронизации:
//     * Успех - Булево
//     * ВсегоПозиций - Число - количество переданных позиций
//     * Синхронизировано - Число - количество успешно синхронизированных позиций
//     * Ошибок - Число - количество позиций с ошибками
//     * ТекстОшибки - Строка - сводный текст ошибок
//
Функция СинхронизироватьВыбранныеПозиции(МассивСсылок, ИспользоватьПакетныйЗапрос = Истина) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Успех", Истина);
	Результат.Вставить("ВсегоПозиций", МассивСсылок.Количество());
	Результат.Вставить("Синхронизировано", 0);
	Результат.Вставить("Ошибок", 0);
	Результат.Вставить("ТекстОшибки", "");
	
	Если МассивСсылок.Количество() = 0 Тогда
		
		Результат.ТекстОшибки = "Не передано ни одной позиции для синхронизации";
		Результат.Успех = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	// Устанавливаем статус "ВОбработке"
	MRS_ЛогированиеИнтеграцииСервер.УстановитьСтатусВОбработке(МассивСсылок);
	
	Если ИспользоватьПакетныйЗапрос Тогда
		
		// Пакетная синхронизация
		РезультатСинхронизации = MRS_ИнтеграцияSimphonyСервер.СоздатьПозицииМенюПакетно(МассивСсылок, 1);
		
		Если РезультатСинхронизации.Успех Тогда
			
			Результат.Синхронизировано = МассивСсылок.Количество();
			
		Иначе
			
			Результат.Успех = Ложь;
			Результат.Ошибок = МассивСсылок.Количество();
			Результат.ТекстОшибки = РезультатСинхронизации.ТекстОшибки;
			
		КонецЕсли;
		
	Иначе
		
		// Поштучная синхронизация
		Для Каждого СсылкаПозиции Из МассивСсылок Цикл
			
			РезультатСинхронизации = MRS_ИнтеграцияSimphonyСервер.СоздатьПозициюМеню(СсылкаПозиции);
			
			Если РезультатСинхронизации.Успех Тогда
				
				Результат.Синхронизировано = Результат.Синхронизировано + 1;
				
			Иначе
				
				Результат.Ошибок = Результат.Ошибок + 1;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Если Результат.Ошибок > 0 Тогда
			
			Результат.Успех = Ложь;
			Результат.ТекстОшибки = СтрШаблон(
				"Синхронизировано: %1, Ошибок: %2",
				Результат.Синхронизировано,
				Результат.Ошибок);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Синхронизирует все несинхронизированные позиции меню
//
// Параметры:
//   ИспользоватьПакетныйЗапрос - Булево - использовать пакетный запрос (по умолчанию Истина)
//
// Возвращаемое значение:
//   Структура - результат синхронизации (аналогично СинхронизироватьВыбранныеПозиции)
//
Функция СинхронизироватьВсеНесинхронизированные(ИспользоватьПакетныйЗапрос = Истина) Экспорт
	
	// Получаем список несинхронизированных позиций
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	MRS_Меню.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.MRS_Меню КАК MRS_Меню
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.MRS_СтатусыСинхронизацииМеню КАК Статусы
		|		ПО MRS_Меню.Ссылка = Статусы.ПозицияМеню
		|ГДЕ
		|	НЕ MRS_Меню.ЭтоГруппа
		|	И (Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизации.Создано)
		|		ИЛИ Статусы.Статус = ЗНАЧЕНИЕ(Перечисление.MRS_СтатусыСинхронизации.Ошибка)
		|		ИЛИ Статусы.Статус ЕСТЬ NULL)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСсылок = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		МассивСсылок.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат СинхронизироватьВыбранныеПозиции(МассивСсылок, ИспользоватьПакетныйЗапрос);
	
КонецФункции

// Синхронизирует все позиции меню для указанного владельца (КассыККМ)
//
// Параметры:
//   КассаККМ - СправочникСсылка.КассыККМ - владелец позиций меню
//   ИспользоватьПакетныйЗапрос - Булево - использовать пакетный запрос (по умолчанию Истина)
//
// Возвращаемое значение:
//   Структура - результат синхронизации (аналогично СинхронизироватьВыбранныеПозиции)
//
Функция СинхронизироватьПоВладельцу(КассаККМ, ИспользоватьПакетныйЗапрос = Истина) Экспорт
	
	Если НЕ ЗначениеЗаполнено(КассаККМ) Тогда
		
		Результат = Новый Структура;
		Результат.Вставить("Успех", Ложь);
		Результат.Вставить("ВсегоПозиций", 0);
		Результат.Вставить("Синхронизировано", 0);
		Результат.Вставить("Ошибок", 0);
		Результат.Вставить("ТекстОшибки", "Не указан владелец (касса ККМ)");
		
		Возврат Результат;
		
	КонецЕсли;
	
	// Получаем все позиции указанного владельца
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	MRS_Меню.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.MRS_Меню КАК MRS_Меню
		|ГДЕ
		|	MRS_Меню.Владелец = &Владелец
		|	И НЕ MRS_Меню.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Владелец", КассаККМ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	МассивСсылок = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		
		МассивСсылок.Добавить(Выборка.Ссылка);
		
	КонецЦикла;
	
	Возврат СинхронизироватьВыбранныеПозиции(МассивСсылок, ИспользоватьПакетныйЗапрос);
	
КонецФункции

#КонецОбласти
